# LEGO ANALYSIS

In [19]:
import pandas as pd

df = pd.read_csv('data/lego_sets.csv')
theme = pd.read_csv('data/parent_themes.csv')

df.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [20]:
theme.head()

    id     name  is_licensed
0    1  Technic        False
1   22  Creator        False
2   50     Town        False
3  112   Racers        False
4  126    Space        False

In [21]:
merged_df = df.merge(theme, left_on="parent_theme", right_on="name")
merged_df.drop(columns="name_y", inplace=True)
merged_df.head()

,set_num,name_x,year,num_parts,theme_name,parent_theme,id,is_licensed
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,411,False
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town,50,False
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle,186,False
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space,126,False
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space,126,False

In [22]:
merged_df[merged_df["set_num"].isnull()].shape #find out how many set number is null

(153, 8)

In [23]:
licensed = merged_df[merged_df["is_licensed"]] #filter out only licensed data
licensed = licensed.dropna(subset=["set_num"]) #filter all the null value in set_number
licensed.head()

star_wars = licensed[licensed["parent_theme"]=="Star Wars"] #filter out the star wars theme from licensed dataframe
the_force = int(star_wars.shape[0]/licensed.shape[0]*100)

print(the_force)

51